       IDENTIFICATION DIVISION.
       PROGRAM-ID. AddSub.

       DATA DIVISION.
       LINKAGE SECTION.
       01 LNUM1 PIC 9(2).
       01 LNUM2 PIC 9(2).
       01 LRESULT PIC 9(3).

       PROCEDURE DIVISION USING LNUM1 LNUM2 LRESULT.
           COMPUTE LRESULT = LNUM1 + LNUM2.
           EXIT PROGRAM.

 